{
"Posts":[
        {
            "title":"Voorbereiden voor de stage aan Robonext",
            "text":"Het Contract voor mijn stage is ondertekend.\nIk ben bijna klaar met de UiPath cursus die mij werd doorgestuurd.\nIk Ben klaar voor een leerijke en interesante stage.",
            "date":"2023/01/21",
            "tags":["Pre-stage","januari"]
        },
        {
            "title":"Voorbereiden voor de stage aan Robonext",
            "text":"Ik heb de UiPath cursus voledig doorgenomen,\nen de about pagina toegevoegd aan mijn portiolio site.\nIk ga dit weken nog enkele modules herhalen waar ik eerder wat moeite mee had,\nen op maandag 02/06 begint mijn eerste stage dag.",
            "date":"2023/02/04",
            "tags":["Pre-stage","februari"]
        },{
            "title":"Eerste stage dag is voorbij.",
            "text":"Mijn eerste dag van mijn Robonext stage is prima verlopen.\nIk heb als eerste kennis gemaakt met mijn collega stagairs, en mijn stage Mentor Dirk.\nOm 9:00 hebben we mogen meezitten met een stand up meeting, met het hele team,\nNa deze meeting hebben we verder uitleg gekregen over het bedrijf en wat van ons word verwacht.\nHierna Heeft Johan ons al een project toegewezen, maar we hebben nog geen analyze gekregen van \nde projecten zelf,Deze komt nog later.\nHierna heb ik vooral gezorgd dat ik in orde ben met software en agenda planning\nMaar het merendeel van de dag heb ik mij bezig gehouden met het voorbereiden voor het project door onder andere,\nal een Entity Framework programma te bouwen en een sql database hieraan te verbinden,\nen de documentatie te lezen voor de orchestrator API.",
            "date":"2023/02/06",
            "tags":["eerste week","februari"]
        },{
            "text":"De tweede dag van de stage begon met de dagelijke stand up meeting om 9:30,\ndeze heeft niet zo lang geduurd doordat er enkele ziek waren en de meeste collega's vandaag\nremote werkten. In voormiddag heb ik mezelf bezig gehouden met het opfrissen van enkele UiPath modules,\nomtrend selectors, dit ging vrij vlot. De rest van de dag heb ik geprobeerd om \nmeer te weten te komen welke endpoints ik zou moeten opvragen en welke data ik zou moeten opslagen\nin de database, dit ging vrij traag, de Orchestrator api is vrij groot\nmet vrij veel endpoints en verschillende scopes en authenticatie mogelijkheden.\n",
            "date":"2023/02/07",
            "tags":["eerste week","voorbereiding project","februari"]
        },{
            "title":"Een rustige maar productieve dag.",
            "text":"Op de derde dag van de stage was ik alleen op het kantoor,\nNa de gebruikelijke Standup meeting in teams om 9:00 ben ik begonnen met nog 2 UiPath modules te herhalen.\nRond 11:00 bheb ik verder gewerkt aan de backend api voor mijn project.\nIk heb eindelijk de authenticatie kunnen voltooien voor de user via de http client.\nDe rest van de dag ben ik bezig geweest met de models te maken voor de EF en dit te testen, \ndoor een user te maken en een acces token op te vragen en deze in de database op te slagen.",
            "date":"2023/02/08",
            "tags":["eerste week","backend","februari"]
        },{
            "title":"Meeting met dirk en johan",
            "text":"Na de gewoonlijke standup meeting, heb ik een gesprek gehad met Johan en Dirk\nover mijn project waarover ik enkele vragen had over requirements, database, front-end en of dat ik een repository moet maken voor het project.\nBij het gesprek heb ik ook geleerd dat we geen requirements krijgen van de het bedrijf, en dat we best zelf een soort van analyze maken van het project.\nHierna heb ik de rest van de dag verder gewerkt aan de backend van het project.\nIk maak vrij goede vooruitgand met de backend, ik heb verder gewerkt aan de models, en met het ophalen van de data in de api.\nIk denk dat ik eind volgende week het merendeel van de api af heb.",
            "date":"2023/02/09",
            "tags":["eerste week","backend","februari"]
        },{
            "title":"Einde van de eerste week.",
            "text":"De eerste week van de stage zit erop.\nIk ben tevreden met wat ik de eerste week heb gepresteerd.\nOmdat ik de UiPath academy all had bestudeerd in het eerste semester naar vraag van Dirk en johan,\nkon ik meer focusen op het project. Er zijn nog enkele onderdelen die ik moet uitschijrven in de backend .net core api,\nen dan is de backend klaar volgens mijn eerste analyze (de kans is groot dat ik deze later nog moet uitbreiden of work arounds moet voorzien).\n",
            "date":"2023/02/10",
            "tags":["backend","eerste week","februari"]
        },{
            "title":"Odata en de Orchestrator api",
            "text":"De Tweede week van de Stage zit er bijna op, deze week heb ik Verder gewerkt aan de backend van mijn project.\nIk zat een tijdje vast aan hoe ik juist de Odata protocol moet gebruiken. Ik had specifiek moeite met het schrijven van de filters voor mijn urls.\nDit heeft de meerderheid van de week ingenomen. Verder heb ik vooral de code opgeruimd en verbeterd.\nOp vrijdag en donderdag heb ik de laatste paar gekende bugs opgelost\nen gezocht naar een geschikte technologie voor de front-end.\nMogelijk ga ik Next.js gebruiken omdat dit framework een aantal nuttige functionaliteiten heeft,\nmaar ik zou hier wat meer moeten inkijken.",
            "date":"2023/02/16",
            "tags":["backend","februari"]
        },{
            "title":"Afwezigheid door ziekte",
            "text":"Deze week was ik jammer genoeg vanaf dinsdag namiddag afwezig wegens ziekte.\nIk was de week hiervoor op vrijdag ook al ziek maar dan had ik ervoor gekozen om van thuis\nuit te werken, in de hoop dat ik mij beter zou voelen na het weekend.\nJammer genoeg was dit niet het geval en moest ik thuis blijven tot eind deze week.\nOm niet achter te lopen heb ik wel gewerkt, namelijk de backend code verbeteren, extra\nendpoints gemaakt, en in de frontend heb ik extra pagina's gemaakt en de weergave van\nenkele data geïmplementeerd. Ik heb ook wat research gedaan naar hoe ik juist user login\nimplementeer maar ik ben nog niet zeker hoe ik dit moet implementeren in mijn project, met de user accounts die ik al heb.",
            "date":"2023/02/24",
            "tags":["februari"]
        },{
            "title":"Einde eerste maand",
            "text": "Wat ik deze week heb gedaan:\nOp maandag:\n- Het debuggen en corrigeren van de post requests naar de backend\n- Het creëren van een tenant specifieke pagina die dynamisch wordt geladen in React.ts\n- Het toevoegen van extra functionaliteit in de organisatie pagina\n\nDinsdag:\n- Het aanpassen van enkele pagina's en components voor een betere stijl.\n- Het ontwerpen en ontwikkelen van een login pagina\n- Het leren over user authenticatie en authorizatie met JWT-tokens\n\nWoensdag:\n- Het toevoegen van rollen aan de database voor de user authorizatie\n- Het herschrijven van de user models en enkele user gerelateerde endpoints\n\nDonderdag:\n- Het maken van een login endpoint dat een token kan genereren om in een cookie op te slaan\n- Het aanpassen van enkele requests zodat ze een token meegeven\n- Het implementeren van claims en roles in de tokens\n- Het opslaan van de token in de cookie\n- Het beveiligen van enkele user post endpoints\n\nVrijdag:\n- Het testen van de endpoints met Postman (een tool voor het maken en versturen van HTTP-requests)\n- Het oplossen van enkele backend bugs die met authenticatie hadden te maken\n- Proberen om de frontend pagina's te beveiligen met React-router-dom\n- Het toevoegen van extra functionaliteit en stijl op pagina's\n\nIntrospectie:\nDeze week was rustig, er is niets bijzonders gebeurd enkel wat vastgezeten met de user authenticatie en het maken van een nieuwe controller voor de endpoint dat wat tijd koste.\nIk denk dat ik langzamaan maar zeker het einde van mijn project benader.\n\nwat er minder goed ging:\n- iets te ambitieus geweest tijdens de daily-standups en gedacht dat ik meer op een dag zou hebben kunnen doen\n- iets te lang bezig geweest met de user authenticatie\n- er zijn nog enkele serieuze bugs in de backend waar ik niet echt zin in had om deze op te lossen, dus deze eventjes opzij gezet\n\nwat er goed ging:\n- persoonlijk denk ik dat ik goede vooruitgang heb geboekt met het project\n",
            "date":"2023/03/03",
            "tags":["februari","maart"]
        },{
            "title":"",
            "text":"Hier is mijn overzicht van vorige week:\n\nMaandag:\n- Pagina's in de frontend beveiligd\n- Fouten opgelost in de frontend\n- Extra styling toegevoegd aan de frontend\n\nDinsdag:\n- Overzicht van huurders gerepareerd\n- Fouten opgelost in de 'folders endpoint'\n- Styling toegevoegd aan de frontend\n- Fouten opgelost in de backend\n- Onderzoek gedaan naar gehoste services in aspNet\n\nWoensdag:\n- Doorgegaan met het oplossen van problemen in de backend\n- Onderzoek gedaan en geprobeerd om gehoste services te implementeren\n\nDonderdag:\n- Gehoste services geïmplementeerd\n- Gehoste service getest\n- Extra styling toegevoegd aan de frontend\n- Proberen de oorzaak te vinden van 'sqlite error 5'\n\nVrijdag:\n- Blijven zoeken naar oplossingen voor databaseproblemen\n- Backend code opgeschoond\n- Extra styling toegevoegd aan de frontend\n- Fouten opgelost in de frontend\n\nReflectie:\nDeze week was behoorlijk productief, omdat ik vooruitgang heb geboekt bij het oplossen van problemen in zowel de frontend als backend, en nieuwe functies zoals gehoste services heb geïmplementeerd. Ik heb echter problemen ondervonden met de database en moest extra tijd besteden aan het oplossen van problemen. Ik ben ervan overtuigd dat ik dichter bij de voltooiing van mijn project kom.",
            "date":"2023/03/10",
            "tags":["maart"]
        },{
            "title":"",
            "text":"Het overzicht van mijn werk van 13 - 17 maart:\n\nMaandag:\n- Debuggen van de backend waar updates eerdere gegevens overschreven\n- Documentatie toegevoegd aan de code\n- Een navigatieprobleem met de robotpagina opgelost\n- Nieuwe functies toegevoegd aan de robotpagina\n\nDinsdag:\n- De bot zo gemaakt dat deze ook periodiek de logs bijwerkt\n- Timeouts toegevoegd aan knoppen\n- Catches toegevoegd om te voorkomen dat de backend crasht\n- Documentatie toegevoegd aan methoden\n\nWoensdag:\n- Deelgenomen aan een jobbeurs\n\nDonderdag:\n- Onnodige entiteiten uit de database verwijderd\n- Een probleem in de database opgelost waarbij een rij voor de huidige dag was gedupliceerd\n- Een cursus op UiPath academy afgerond\n- Doorgegaan met het oplossen van het databaseprobleem\n\nVrijdag:\n- Doorgegaan met het verbeteren en debuggen van zowel de front-end als back-end code\n- Getest op bugs\n- Opnieuw geprobeerd om het probleem met dubbele gegevens in de database op te lossen\n\nReflectie:\nDeze week was een mix van debuggen, documentatie, vooral omdat ik niet zeker wist wat ik nog zou moeten doen.\nNormaal gezien zou ik een demo hebben gegeven op dinsdag maar wegens omstandigheden is dit niet doorgegaan.\nIk kon voortgang maken met de backend-code door problemen met updates en crashes op te lossen. Ook werkte ik aan de frontend door nieuwe functies toe te voegen en navigatieproblemen op te lossen. Op donderdag nam ik deel te nemen aan de jobbeurs, dit was verplicht van shool. Ik heb deze week vooral bezig geweest in de backend omdat ik moeite had met het oplossen van enkele bugs in de backend. Over het algemeen voel ik dat ik bijna alle bugs uit het programma heb gehaald,\nBinnekort zou Dirk ook de projecten klaar hebben waar wij mee aan zouden kunnen werken, dus dat is iets om naar uit te kijken.",
            "date":"2023/03/17",
            "tags":["maart"]
        },{
            "title":"geven van een demo",
            "date":"2023/03/24",
            "tags":["maart"],
            "text":"maandag:\n- Debuggen van de front-end om eventuele fouten te vinden en op te lossen\n- Testen en debuggen van problemen met de database waarbij dubbele gegevens zouden worden gegenereerd\n\ndinsdag:\n- Doorgaan met het debuggen van de front-end en het toevoegen van extra pagina's voor gebruikers\n- Een probleem oplossen met MUI-inputvelden die doubles niet accepteren\n- Verbeteren van de styling van de front-end\n\nwoensdag:\n- Debuggen van de backend om eventuele fouten te vinden en op te lossen\n- Verbeteren van foutafhandeling in de front-end\n- Toevoegen van een nieuwe pagina voor gebruikers\n- Voorbereiden op de demo\n- Geven van een demo van de applicatie aan Johan, Joris en Dirk\n- Notities maken van de feedback die ontvangen is\n- Implementeren van enkele van de feedbackpunten\n\ndonderdag:\n- Onderzoek doen naar hoe veranderingen op basis van feedback geïmplementeerd kunnen worden\n- Doorgaan met het implementeren van feedbackpunten\n- Oplossen van kleine bugs\n- Toevoegen van verwerkingstijd aan bepaalde variabelen in de database\n\nvrijdag:\n- Onderzoek doen naar hoe veranderingen op basis van feedback geïmplementeerd kunnen worden\n- Opnieuw ontwerpen van de weergavepagina\n- Zorgen dat de backend niet crasht als de API offline is.\n\nReflectie:\nTijdens deze week heb ik vooral mijn tijd besteed aan het debuggen van het project. Op woensdag moest ik een demo geven van de applicatie aan Johan en Joris, dit ging redelijk goed, Johan had zelfs gezegd dat hij al onder de indruk was van wat ik had geproduceerd. Er was niet heel veel commentaar, het meeste ging over de styling en dat er wat meer data moet worden getoond.\nIk heb inmiddels iets meer dan de helft van de feedback toegepast, maar ik heb momenteel een beetje moeite met inbrengen van de nieuwe data die Johan en Joris graag nog in de applicatie zouden hebben, specifiek met het verkrijgen van de data.\n\nIk had op dit moment in mijn stage al graag begonnen met de UiPath projecten waar ik zou aan kunnen meewerken(documentatie schrijven).\nMaar hierover hebben we nog niet veel van gehoord."
        },{
            "title":"Extra Opdrachten",
            "date":"2023/03/28",
            "tags":["maart"],
            "text":"Ik en Jellis hebben vandaag een extra opdracht gekregen, deze opdracht gaat over het updaten van een UiPath workflow en een Power automate flow.\nBijde workflows dienen als een demo voor klanten, maar deze waren meer dan een jaar geleden gemaakt, en één hiervan werkt zelfs nog met exporer.\nDeze workflows moeten dus worden geüpdatet naar de nieuwste versie van UiPath en Power automate.\n\nDeze opdracht is een goede oefening voor het werken met UiPath en Power automate, en het is ook een goede oefening voor het werken met een bestaand project."        
        },{
            "title":"",
            "date":"2023/03/31",
            "tags":["maart"],
            "text":"Maandag:\n- Feedback van demo implementeren\n- Proces tijd per proces verdelen\n\nDinsdag:\n- Feedback implementeren\n- Proces tijd per proces verdelen\n- Nieuw project starten voor unit tests\n\nWoensdag:\n- Feedback implementeren\n- Styling aanpassen\n- Grafieken aanpassen\n- Database mocken voor unit testing\n\nDonderdag:\n- Unit tests schrijven\n- Probleem met grafieken oplossen\n- Inloggen op de VM om aan een PA-workflow te werken\n- Vergadering met Ann\n\nVrijdag:\n- Probleem met gemockte database oplossen\n- Doorgaan met het schrijven van tests\n- Styling aanpassen\n\nDeze week was vrij rustig, ik heb vooral de feedback van de demo verder geïmplementeerd.\nVerder ben ik begonnen met het mocken van de database en de context, maar dit ging iets moeilijker omdat er in aspNet EF web api vrij veel achter de schermen gebeurt.\nDeze week hebben Jellis en ik nog een extra opdracht gekregen. We moeten 2 demo workflows (1 van UiPath en 1 van Power Automate) updaten omdat deze verouderd zijn.\nJellis en ik hebben beslist om elk één taak te doen en omdat hij meer ervaring had met UiPath wilde hij die taak doen. Dus heb ik die van Power Automate. Dit gaat momenteel vrij vlotjes. Ik heb de gevraagde aanpassingen al aangebracht en wacht op feedback van Joris."
        },{
            "title":"Afwerken extra opdrachten",
            "date":"2023/04/07",
            "tags":["april","Opdracht Joris"],
            "text":"Maandag:\n- Begin het aanpassen van de demo flow voor Joris,\n- Verder de database mocken,\n- Styling aanpassen,\n- Backend debuggen\n\nDinsdag:\n- Unit tests schrijven,\n- Styling aanpassen,\n- Debuggen aan de front-end\n\nWoensdag:\n- Verder unit tests schrijven,\n- Verder unit tests schrijven en het mocken van de database,\n- Kleinere debugging,\n\nDonderdag:\n- Enkele aanpassingen aan de opdracht voor joris aanbrenen,\n- Nieuwe feedback gekregen van Johan,\n- Styling aanpassen aan feedback,\n- Verder unit tests schrijven,\n\nVrijdag:\n- Debugging aan de backend\n- Verder tests schrijven,\n- Styling aanpassen.\n\nReflectie: Ik heb deze week de opdracht voor Joris voltooid,\ndit ging vrij vlot, en was niet te moeilijk, en het is een interessante verandering van werk.\nwe hebben ook van Dirk gehoord dat we volgende week nog een nieuwe opdracht krijgen deze gaat het maken van annotations in Metamaze zijn.\nverder heb ik deze week ook nog wat extra feedback gekregen omtrent de styling en welke data moet worden weergegeven, dus deze feedback ben ik aan het aanbrengen aan de frontend.\neind deze week had ik ook al +-50 unit tests geschreven.\ndus ik heb deze week vrij veel gedaan, en alles ging ook vlot zonder al te veel problemen.\n"
        },{
            "title":"Metamaze",
            "date":"2023/04/14",
            "tags":["april","Opdracht Metamaze"],
            "text":"Op maandag was het paasmaandag waarop we niet hebben gewerkt dus deze week is iets korter.\n\ndinsdag\n- doorgaan met het schrijven van unit tests voor database gerelateerde methoden\n- vormgeven van de front-end\n- het ontwikkelen van foutafhandeling in de front-end voortzetten\n\nwoensdag\n- afronden van het schrijven van unit tests voor de database.\n- oplossen van enkele bugs die ik heb gevonden in de front-end en herwerken van de authenticatie-eindpunten\n- toevoegen van een standaardbeheerder wanneer de backend voor de eerste keer wordt gestart.\n- een nieuwe taak van Dirk ontvangen om met Joris te werken,\n\ndonderdag\n- onderzoek doen naar de documentatie van Metamaze.\n- enkele aanvullende unit tests schrijven.\n- entiteiten gemaakt in Metamaze,\n- de bestanden geüpload om met Metamaze te werken\n\nvrijdag\n- na overleg met Jellis hebben we besloten om de entiteiten in Metamaze te herwerken.\n- we zaten echt vast bij het definiëren van wat onze entiteiten zouden moeten zijn, we hebben hulp gekregen van Dirk, Harold en Kremena, maar we zijn niet ver gekomen.\n\nReflectie:\nIk heb deze week vrij veel unit tests kunnen schrijven en ben voor een groot deel hiermee klaar.\nOp woensdag kregen we een nieuwe opdracht, die inhoudt dat we via Metamaze een AI trainen die data uit een document haalt en deze doorstuurt naar een Uipath robot.\nIn het begin dacht ik dat dit een redelijk makkelijke opdracht ging zijn, Dirk had zelf gezegd dat dit een nogal saaie job was waar je veel moet herhalen.\nDit is echter een stuk moeilijker, we moeten de AI data kunnen laten identificeren uit bestellingen van verschillende leveranciers, maar het moeilijke hierbij is dat er veel kan verschillen tussen de leveranciers, en de functionaliteit van Metamaze entiteiten is nogal limiterend."        
        },
        {
           "title":"",
            "date":"2023/04/21",
            "tags":["april"],
            "text":"Maandag:\n- Gecontinueerd met entiteiten en annotaties\n- Gewerkt aan het debuggen van de frontend\n\nDinsdag:\n- Een nieuw admin paneel toegevoegd aan de app\n- Gevraagd of we door moesten gaan met de Metamaze opdracht\n\nWoensdag:\n- Unit tests schrijven en de methodes voor het admin paneel afmaken\n- Proberen om de toepassingsscope die nodig is voor de API te beperken\n- Intervisie op AP\n\nDonderdag:\n- De scopes beperkt\n- Meer unit tests schrijven\n- Joris vertelde me dat er iets mis was met de PA-flow, dus dat heb ik opgelost\n\nVrijdag:\n- Een melding toevoegen om te zien of je de verkeerde referenties hebt ingevoerd\n- Nieuwe functies debuggen\n- Een aparte pagina maken voor huurders\n- Doorgaan met het schrijven van tests\n\nReflectie:\nDeze week was vrij druk. Het toevoegen van een nieuw admin-panel en de functionaliteit om te controleren of er verkeerde inloggegevens zijn ingevoerd was een uitdaging, \nmaar ik ben blij dat het gelukt is. Het schrijven van unit tests is ook een belangrijk onderdeel van mijn werk geworden en ik heb deze week veel tijd besteed aan het schrijven ervan.\nOmtrent de Metamaze-opdracht, nadat een collega een support e-mail had verstuurd en we hier antwoord op hadden gekregen,\ngingen Joris en Johan hierover vergaderen omdat de functionaliteit die we nodig hebben nog experimenteel is en ze niet zeker zijn of dit oké is voor Torfs.\nDus in plaats van aan de Metamaze-opdracht te werken, heb ik gewoon verder aan mijn opdracht gewerkt. Ik denk dat deze inmiddels bijna klaar is." 
        },
        {
            "title":"",
            "date":"2023/04/28",
            "tags":["april"],
            "text": "Maandag:\nVandaag heb ik verschillende problemen opgelost aan de frontend die te maken hadden met de requests naar de backend. Dit kostte meer tijd dan verwacht omdat het soms lastig was om de oorzaak van de problemen te vinden.\n\nDinsdag:\nVandaag heb ik voornamelijk gewerkt aan het verbeteren van de frontend code. Ik heb een aantal componenten opgedeeld in kleinere delen om de code beter te organiseren en het beheer ervan gemakkelijker te maken. Dit was een flinke klus, maar ik denk dat het de moeite waard was omdat het de code veel overzichtelijker maakt en het gemakkelijker maakt om nieuwe functies toe te voegen.\n\nWoensdag:\nIk had me vergist en dacht dat ik deze week een demo moest geven, dus ik heb vooral ervoor gezorgd dat alles vlotjes werkte en niet al te veel aanpassingen gedaan. Ik heb een aantal kleine bugs opgelost en wat verbeteringen aangebracht aan de UI, maar verder was het een rustige dag.\n\nDonderdag:\nVandaag heb ik nieuwe unit tests geschreven en enkele bestaande tests herschreven om de dekking te vergroten en eventuele fouten te vinden voordat deze zich voordoen in de productieomgeving. Daarnaast ben ik ook begonnen met het leren van Power Automate Cloud, omdat we hier binnenkort mee gaan werken.\n\nVrijdag:\nOp vrijdag heb ik de hele dag gestudeerd over Power Automate Cloud. Hoewel het nog veel te leren is, begin ik het langzaam beter te begrijpen en ben ik enthousiast om deze nieuwe vaardigheid te kunnen toepassen in onze projecten.\n\nReflectie:\nDeze week heb ik me voornamelijk gericht op het verbeteren van de frontend code en het schrijven van unit tests. Ik ben blij dat ik deze week de tijd heb kunnen nemen om nieuwe vaardigheden te leren en bestaande vaardigheden te verbeteren."
        },
        {
            "title":"",
            "date":"2023/05/06",
            "tags":["mei"],
            "text":"Maandag:\nMaandag was een feestdag, dus hadden we geen werk.\n\nDinsdag:\nVandaag heb ik gewerkt aan het verbeteren van de code en het schrijven van documentatie voor ons project. Daarnaast ben ik begonnen met het leren van Power Automate.\n\nWoensdag:\nVandaag heb ik me gericht op het verbeteren van de error handling wanneer er geen verbinding kan worden gemaakt met de server. Daarnaast heb ik ook een bug opgelost waarbij data entities niet werden verwijderd wanneer een ander entiteit met een relatie werd verwijderd.\n\nDonderdag:\nVandaag heb ik me gericht op het oplossen van kleinere bugs in de frontend en het schrijven van een readme-document voor de backend API als documentatie.\n\nVrijdag:\nVandaag heb ik mij gericht op het debuggen van enkele error catches in de frontend. Daarnaast heb ik Jellis geholpen bij het oplossen van een probleem met zijn project met SQLite.\n\nReflectie:\nDeze week heb ik me gericht op het verbeteren van de code en het oplossen van verschillende bugs. Daarnaast heb ik tijd besteed aan het leren van nieuwe vaardigheden, zoals Power Automate. Ik ben tevreden met wat ik heb bereikt en ik kijk ernaar uit om mijn vaardigheden verder te ontwikkelen en meer bij te dragen aan ons project."
        },
        {
            "title":"",
            "date":"2023/05/12",
            "tags":["mei"],
            "text":"Maandag:\nVandaag heb ik unit tests geschreven en de readme aangepast om de veranderingen in de endpoint te reflecteren. Daarnaast heb ik getest op bugs en een frontend bug opgelost.\n\nDinsdag:\nVandaag heb ik mij gericht op het voortzetten van de unit tests en het verbeteren van de frontend code. Daarnaast heb ik bugs opgelost in de frontend en heb ik tijd besteed aan het leren van Power Automate.\n\nWoensdag:\nVandaag heb ik geoefend en geleerd over de flows in Power Automate. Ik raakte vast bij het starten van een flow vanuit een cloud flow en heb geprobeerd een bug op te lossen die verband houdt met autorisatie.\n\nDonderdag:\nIk besefte dat de bug niet te wijten was aan autorisatie, maar aan slechte invoer van de gebruiker. Ik implementeer nu regex om de slechte invoer te filteren en ben doorgegaan met het oefenen van Power Automate.\n\nVrijdag:\nIk ga door met het implementeren van regex-validatie en het oplossen van bugs die verband houden met de gebruikersinvoer. Ook blijf ik oefenen met Power Automate.\n\nReflectie:\nDeze week heb ik veel tijd besteed aan het testen van code en het oplossen van bugs. Daarnaast heb ik nieuwe vaardigheden geleerd en geoefend met Power Automate. Het oplossen van de bug gerelateerd aan slechte gebruikersinvoer was een uitdaging, maar ik heb er veel van geleerd. Ik ben tevreden met mijn voortgang en kijk uit naar de volgende week."
        },
        {
            "title":"",
            "date":"2023/05/21",
            "tags":["mei"],
            "text":"Maandag:\n- Zorgen dat alles werkt voor de demo.\n- Meer documentatie toevoegen aan de code.\n- Oplossing gevonden voor incorrecte berekening van besparingen.\n- Kleine bugfixes uitgevoerd.\n- Oefenen met Power Automate.\n\nDinsdag:\n- Doorgaan met het schrijven van documentatie.\n- Zoeken naar mogelijke bugs die kunnen optreden tijdens de demo.\n- Oefenen met Power Automate.\n\nWoensdag:\n- Aanvullende documentatie schrijven.\n- Deelnemen aan een team evenement bij de Ruien.\n- Een demo geven voor RoboNext.\n\nDonderdag:\n- Vrije dag.\n\nVrijdag:\n- Een bug oplossen die tijdens de demo is opgetreden.\n- Beginnen met het implementeren van ontvangen feedback.\n- Code opschonen.\n- Documentatie schrijven.\n- Sommige unit tests herschrijven vanwege wijzigingen in de Database class.\n\nReflectie:\nGedurende de week heb ik tijd besteed aan het zorgen dat het project soepel zou verlopen voor de demo door bugs op te lossen en noodzakelijke wijzigingen door te voeren. Ik heb me ook gericht op het verbeteren van de documentatie en het oefenen met Power Automate. Het team evenement en de demo voor RoboNext boden waardevolle mogelijkheden om de voortgang te tonen. Ondanks de uitdagingen, zoals de bug tijdens de demo, was de demo geslaagd. Ik ben tevreden met de resultaten van de demo en de feedback die ik heb gekregen, die volledig positief was, met enkele nieuwe ideetjes die ik nog kan implementeren."
        },{
            "title":"",
            "date":"2023/05/28",
            "tags":["mei"],
            "text":"Maandag:\n- Vrije dag.\n\nDinsdag:\n- Opnieuw onderzoeken van CORS gerelateerde problemen.\n- Testen van CORS met een virtuele machine.\n- Verbeteren van backend code.\n- Debuggen van enkele kleine problemen met autorisatie.\n- Bijwerken van de readme om enkele wijzigingen in de endpoints weer te geven.\n\nWoensdag:\n- Testen van CORS met 2 verschillende fysieke machines.\n- Doorgaan met het oplossen van een van de bugs die problemen veroorzaken met autorisatie.\n\nDonderdag:\n- Verbeteren van de code door deze leesbaarder te maken en het toepassen van SOLID-principes op code waar dit nog niet het geval was.\n\nVrijdag:\n- De frontend en backend nog eens nakijken, en zorgen dat alles klaar is om over te handingen aan het Robonext team.\n- Proberen Jellis te helpen met het oplossen van een bug in zijn project.\n\nReflectie:\nDeze week heb ik me gericht op het oplossen van bugs en het verbeteren van de code. Ik heb ook tijd besteed aan het testen van CORS en het oplossen van problemen met autorisatie.\nDit was de laatste week van mijn stage bij Robonext.\nIk ben tevreden met de resultaten van mijn stage en ik heb veel geleerd over het werken in een team en het werken met nieuwe technologieën.\nIk heb ook veel geleerd over het oplossen van bugs en het schrijven van unit tests.\nIk ben blij dat ik de kans heb gekregen om deel uit te maken van dit team en ik kijk uit naar de volgende keer dat ik met hen kan samenwerken."

        }
    ]
}
